Revit 2027 API
BuiltInFailures.FamilyFailures.InstOutsideFaceBoundary Property
 Instance origin does not lie on host face. Instance will lose association to host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InstOutsideFaceBoundary { get; }
Public Shared ReadOnly Property InstOutsideFaceBoundary As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InstOutsideFaceBoundary {
	FailureDefinitionId^ get ();
}
static member InstOutsideFaceBoundary : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace